<a href="https://colab.research.google.com/github/nurimammasri/Wooky-Pandas/blob/master/07.%20Reshaping%20Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Introduction**
Dalam beberapa kasus kita perlu melakukan reshaping terhadap data untuk mengubah data yang ‘tidy’ menjadi data yang lebih relevan dan lebih optimal untuk di jadikan bahan analisis.

Ada beberapa teknik reshaping data di pandas, beberapa diantaranya yang akan dijelaskan dalam artikel ini adalah Pivoting dan Melting.

# **Pivoting (Rows -> Columns)**
![reshaping_data_pivot.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/reshaping_data_pivot.png)

[Pandas Dokumentation](https://pandas.pydata.org/docs/user_guide/reshaping.html#reshaping-by-pivoting-dataframe-objects)

Pivoting adalah suatu pengubahan bentuk data dengan memutar data yang terletak di baris menjadi di column. coba perhatikan gambar di atas.

Kita juga dapat mengatakan pivoting tabel adalah melakukan perubahan pada bentuk data dari yang tadinya panjang menjadi lebar.

Ada beberapa metode untuk melakukan pivoting di pandas, yaitu `pivot() dan pivot_table()`, namun metode yang bagus adalah pivot_table(), oleh karena itu di artikel ini akan di tunjukan contoh melakukan perubahan bentuk data dengan metode pivot.

## **Menggunakan .pivot()**

`df.pivot(index=None, columns=None, values=None)` -> 'DataFrame'

Parameters

..............


*   `index` : str or object, optional

Column to use to make new frame's index. If None, uses existing index.

*   `columns` : str or object

Column to use to make new frame's columns. not duplicate value on pivoting.

*   `values` : str, object or a list of the previous, optional

Column(s) to use for populating new frame's values. If not specified, all remaining columns will be used and the result will have hierarchically indexed columns.

In [ ]:
import pandas as pd
df = pd.DataFrame()

In [ ]:
df.pivot?

**Type Syntex Pivoting**

wajib parameter 'index' and 'columns'
> df.pivot(index=' ', columns=' ')

catatan : maka nilai value adalah selain dari nilai index dan column

> df.pivot(index=' ', columns=' ', value=[ , , ])

> df.pivot(index=' ', columns=' ')[ , , ]

catatan : [ , , ] boleh memilih banyak values

Untuk simplicity, kita akan menggunakan data buatan. misalkan kita mempunyai data seperti yang ada pada gambar diatas

In [ ]:
import pandas as pd
data = {
    'foo' : ['one']*3 + ['two']*3,
    'bar' : ['A', 'B', 'C', 'A', 'B', 'C'],
    'baz' : [1, 2, 3, 4, 5, 6],
    'zoo' : ['x', 'y', 'z', 'q', 'w', 't']
}
df = pd.DataFrame(data)
print(df)

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [ ]:
df.pivot(index='foo', columns='bar')

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

In [ ]:
pivoted = df.pivot(index='foo', columns='bar')
print(type(pivoted))
pivoted

<class 'pandas.core.frame.DataFrame'>

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

In [ ]:
pivoted['zoo']

bar  A  B  C
foo
one  x  y  z
two  q  w  t

In [ ]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [ ]:
df.pivot(index='foo', columns='bar')['baz']

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [ ]:
df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

In [ ]:
import pandas as pd
penjualan = {
    'toko':['Bandung', 'Garut', 'Jakarta', 'Bandung', 'Garut', 'Jakarta'],
    'Barang':['Telur', 'Telur', 'Telur', 'Minyak', 'Minyak', 'Minyak'],
    'Hasil':[200000, 300000, 150000, 100000, 120000, 400000]
}

df = pd.DataFrame(penjualan)
df

      toko  Barang   Hasil
0  Bandung   Telur  200000
1    Garut   Telur  300000
2  Jakarta   Telur  150000
3  Bandung  Minyak  100000
4    Garut  Minyak  120000
5  Jakarta  Minyak  400000

In [ ]:
df.pivot(index='toko', columns='Barang', values=['Hasil'])

          Hasil
Barang   Minyak   Telur
toko
Bandung  100000  200000
Garut    120000  300000
Jakarta  400000  150000

In [ ]:
# A ValueError is raised if there are any duplicates.
df_duplicate = pd.DataFrame({"foo": ['one', 'one', 'two', 'two'],
                   "bar": ['A', 'A', 'B', 'C'],
                   "baz": [1, 2, 3, 4]})
df_duplicate

   foo bar  baz
0  one   A    1
1  one   A    2
2  two   B    3
3  two   C    4

In [ ]:
# df.pivot(index='foo', columns='bar', values='baz')
# Index contains duplicate entries, cannot reshape

pivot() will error with a ValueError: Index contains duplicate entries, cannot reshape if the index/column pair is not unique. In this case, consider using `pivot_table()` which is `a generalization of pivot that can handle duplicate values for one index/column pair`.

## **Menggunakan .pivot_table()**

`pd.pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False)` -> 'DataFrame'

Parameters

...............


* **`data`**: a DataFrame object.

* **`values`**: a column or a list of columns to aggregate.

* **`index`**: a column, Grouper, array which has the same length as data, or list of them. Keys to group by on the pivot table index. If an array is passed, it is being used as the same manner as column values.

* **`columns`**: a column, Grouper, array which has the same length as data, or list of them. Keys to group by on the pivot table column. If an array is passed, it is being used as the same manner as column values.

* **`aggfunc`**: function to use for aggregation, defaulting to numpy.mean.

* **`fill_value`** : scalar, default None

    Value to replace missing values with.

* **`margins`** : bool, default False

    Add all row / columns (e.g. for subtotal / grand totals).

* **`dropna`** : bool, default True

    Do not include columns whose entries are all NaN.

* **`margins_name`** : str, default 'All'

    Name of the row / column that will contain the totals when margins is True.

* **`observed`** : bool, default False

    This only applies if any of the groupers are Categoricals.

    If True: only show observed values for categorical groupers.

    If False: show all values for categorical groupers.

.....................

Kemudian kita akan melakukan pivoting tabel seperti yang ada di gambar, maka ada beberapa argument paling penting di dalam method pivot_tabel yang perlu kita perhatikan, diantaranya :

1. values : Argumen ini mendefiniskan column mana dari dataframe yang asli yang akan di jadikan values yang ingin kita lihat di dalam hasil pivoting tabel kita.
2. columns : Data dari column mana yang akan dijadikan column baru di dalam hasil pivoting dataframe kita.
3. index : Data dari column mana yang akan dijadikan index di dalam hasil pivoting dataframe kita.

In [ ]:
pd.pivot_table?

In [ ]:
import pandas as pd
penjualan = {
    'toko':['Bandung', 'Garut', 'Jakarta', 'Bandung', 'Garut', 'Jakarta'],
    'Barang':['Telur', 'Telur', 'Telur', 'Minyak', 'Minyak', 'Minyak'],
    'Hasil':[200000, 300000, 150000, 100000, 120000, 400000]
}

df = pd.DataFrame(penjualan)
df

      toko  Barang   Hasil
0  Bandung   Telur  200000
1    Garut   Telur  300000
2  Jakarta   Telur  150000
3  Bandung  Minyak  100000
4    Garut  Minyak  120000
5  Jakarta  Minyak  400000

In [ ]:
df.pivot_table(index='toko', columns='Barang', values='Hasil')

Barang   Minyak   Telur
toko
Bandung  100000  200000
Garut    120000  300000
Jakarta  400000  150000

In [ ]:
import pandas as pd
penjualan2 = {
    'toko':['Bandung', 'Garut', 'Jakarta', 'Bandung', 'Garut', 'Jakarta'],
    'Barang':['Telur', 'Telur', 'Telur', 'Minyak', 'Minyak', 'Minyak'],
    'Hasil':[240000, 320000, 200000, 300000, 150000, 200000]
}

df2 = pd.DataFrame(penjualan2)
df2

      toko  Barang   Hasil
0  Bandung   Telur  240000
1    Garut   Telur  320000
2  Jakarta   Telur  200000
3  Bandung  Minyak  300000
4    Garut  Minyak  150000
5  Jakarta  Minyak  200000

In [ ]:
df_gabung = df.append(df2, ignore_index=True) # make duplicate
df_gabung

       toko  Barang   Hasil
0   Bandung   Telur  200000
1     Garut   Telur  300000
2   Jakarta   Telur  150000
3   Bandung  Minyak  100000
4     Garut  Minyak  120000
5   Jakarta  Minyak  400000
6   Bandung   Telur  240000
7     Garut   Telur  320000
8   Jakarta   Telur  200000
9   Bandung  Minyak  300000
10    Garut  Minyak  150000
11  Jakarta  Minyak  200000

In [ ]:
# maka akan meng-aggregate data duplicate dengan default np.mean
df_gabung.pivot_table(index='toko', columns='Barang', values='Hasil')

Barang   Minyak   Telur
toko
Bandung  200000  220000
Garut    135000  310000
Jakarta  300000  175000

In [ ]:
# maka akan meng-aggregate data duplicate dengan sum
df_gabung.pivot_table(index='toko', columns='Barang', values='Hasil', aggfunc='sum')

Barang   Minyak   Telur
toko
Bandung  400000  440000
Garut    270000  620000
Jakarta  600000  350000

In [ ]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo", 
                         "bar", "bar", "bar", "bar"],
                    "B": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "C": ["small", "large", "large", "small",
                          "small", "large", "small", "small",
                          "large"],
                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [ ]:
# This first example aggregates values by taking the sum.
import numpy as np
table = pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'], aggfunc=np.sum)
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [ ]:
table = pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'], aggfunc=np.sum, fill_value=0)
table

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

In [ ]:
# aggregates by taking the mean across multiple columns.
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'], aggfunc={'D': np.mean, 'E': np.mean})
table

                  D         E
A   C
bar large  5.500000  7.500000
    small  5.500000  8.500000
foo large  2.000000  4.500000
    small  2.333333  4.333333

In [ ]:
# We can also calculate multiple types of aggregations for any given value column.
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'], aggfunc={'D': np.mean, 'E': [min, max, np.mean]})
table

                  D    E
               mean  max      mean  min
A   C
bar large  5.500000  9.0  7.500000  6.0
    small  5.500000  9.0  8.500000  8.0
foo large  2.000000  5.0  4.500000  4.0
    small  2.333333  6.0  4.333333  2.0

In [ ]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}
df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          590                 96
1        UAS1         Fisika                          423                 59
2        UTS2         Fisika                          577                 67
3        UAS2         Fisika                          760                 95
4        UTS1     Matematika                          458                 50
5        UAS1     Matematika                          346                 48
6        UTS2     Matematika                          498                 56
7        UAS2     Matematika                          697                 45
8        UTS1     Statistika                          534                 64
9        UAS1     Statistika                          737                 83
10       UTS2     Statistika                          718                 59
11       UAS2     Statistika                          257                 52

In [ ]:
# code here
df.pivot_table(index = 'Tipe Ujian', columns='Mata Pelajaran', values=['Rata2 Nilai Ujian', 'Rata2 Waktu Belajar (menit)'] )

               Rata2 Nilai Ujian             ... Rata2 Waktu Belajar (menit)
Mata Pelajaran            Fisika Matematika  ...                  Matematika Statistika
Tipe Ujian                                   ...
UAS1                          59         48  ...                         346        737
UAS2                          95         45  ...                         697        257
UTS1                          96         50  ...                         458        534
UTS2                          67         56  ...                         498        718

[4 rows x 6 columns]

In [ ]:
import pandas as pd

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1']*3,
    'Mata Pelajaran' :['Statistika', 'Fisika', 'Fisika', 'Statistika', 'Fisika', 'Statistika'],
    'Jumlah Peserta' : [14, 17, 12, 16, 14, 13]
}
df = pd.DataFrame(data).set_index('Tipe Ujian')
df

           Mata Pelajaran  Jumlah Peserta
Tipe Ujian
UTS1           Statistika              14
UAS1               Fisika              17
UTS1               Fisika              12
UAS1           Statistika              16
UTS1               Fisika              14
UAS1           Statistika              13

In [ ]:
df.pivot_table(index='Tipe Ujian', columns='Mata Pelajaran', values='Jumlah Peserta', aggfunc='sum')

Mata Pelajaran  Fisika  Statistika
Tipe Ujian
UAS1                17          29
UTS1                26          14

# **Melt (Columns -> Rows) (Unpivoting)**

![reshaping_data_melt.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/reshaping_data_melt.png)

`Melting` adalah `unpivoting`, melting mengubah suatu data dengan memutar dari yang tadinya berada di posisi column menjadi di posisi row.

`Melting` mengubah data yang tadinya lebar menjadi panjang.

`Melting` berguna ketika ada suatu kasus dimana terdapat satu atau lebih column yang merupakan identifier variable, dan columnn lain adalah measure variabel. Identifier variabel adalah suatu entitias yang melakukan identifikasi terhadap suatu variabel yang sedang di ukur.

Apabila kita memiliki suatu besaran yang nilainya selalu berubah, kemudian kita ingin mengamati perubahan itu, berarti kita sedang memperlakukan besaran itu sebagai measure variabel. dan kita perlu sesuatu yang mereferensikan perubahan tersebut. hal itu di sebut identifier variable.

contohnya nyatanya adalah apabila kita mengamati perubahan suhu setiap waktu. maka perubahan suhu adalah variabel yang di ukur, dan waktu adalah identifier variabel.

Dalam menggunakan `method melt`, ada beberapa argument yang penting untuk di perhatikan, diantaranya adalah :



*   `id_vars` : columns mana yang akan dijadikan identifier variabel

*   `value_vars` : columns yang akan menjadi value setelah kita melakukan ‘unpivot’ terhadap variabel, jika tidak di definisikan maka semua column selain id_vars akan dijadikan value_vars

* `var_name` = untuk bagian nama columns value variable

* `value_name` = untuk bagian nama columns value 'value'

---

`pd.melt(df, id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None)`

Parameters

---

*   `id_vars` : tuple, list, or ndarray, optional

    Column(s) to use as identifier variables.

*   `value_vars` : tuple, list, or ndarray, optional

    Column(s) to unpivot. If not specified, uses all columns that are not set as `id_vars`.

*   `var_name` : scalar

    Name to use for the 'variable' column. If None it uses ``frame.columns.name`` or 'variable'.

*   `value_name` : scalar, default 'value'

    Name to use for the 'value' column.

*   `col_level` : int or str, optional

    If columns are a MultiIndex then use this level to melt.

In [ ]:
# pd.melt?

In [ ]:
# Membuat datafame sederhana
  
# importing pandas as pd 
import pandas as pd 
  
# membuat dataframe
df = pd.DataFrame({'Name': {0: 'John', 1: 'Bob', 2: 'Shiela'}, 
                   'Course': {0: 'Masters', 1: 'Graduate', 2: 'Graduate'}, 
                   'Age': {0: 27, 1: 23, 2: 21}}) 
df

     Name    Course  Age
0    John   Masters   27
1     Bob  Graduate   23
2  Shiela  Graduate   21

In [ ]:
# Unpivot table 
pd.melt(df, id_vars =['Name'], value_vars =['Course', 'Age'])

     Name variable     value
0    John   Course   Masters
1     Bob   Course  Graduate
2  Shiela   Course  Graduate
3    John      Age        27
4     Bob      Age        23
5  Shiela      Age        21

In [ ]:
import pandas as pd
penjualan = {
    'toko':['Bandung', 'Garut', 'Jakarta', 'Bandung', 'Garut', 'Jakarta'],
    'Barang':['Telur', 'Telur', 'Telur', 'Minyak', 'Minyak', 'Minyak'],
    'Hasil':[200000, 300000, 150000, 100000, 120000, 400000]
}

df = pd.DataFrame(penjualan)
df

      toko  Barang   Hasil
0  Bandung   Telur  200000
1    Garut   Telur  300000
2  Jakarta   Telur  150000
3  Bandung  Minyak  100000
4    Garut  Minyak  120000
5  Jakarta  Minyak  400000

In [ ]:
df.melt(id_vars=['toko', 'Barang'], value_vars='Hasil')

      toko  Barang variable   value
0  Bandung   Telur    Hasil  200000
1    Garut   Telur    Hasil  300000
2  Jakarta   Telur    Hasil  150000
3  Bandung  Minyak    Hasil  100000
4    Garut  Minyak    Hasil  120000
5  Jakarta  Minyak    Hasil  400000

In [ ]:
df.melt(id_vars=['toko', 'Barang'], value_vars='Hasil', var_name='Keterangan', value_name='Harga')

      toko  Barang Keterangan   Harga
0  Bandung   Telur      Hasil  200000
1    Garut   Telur      Hasil  300000
2  Jakarta   Telur      Hasil  150000
3  Bandung  Minyak      Hasil  100000
4    Garut  Minyak      Hasil  120000
5  Jakarta  Minyak      Hasil  400000

In [ ]:
current_df = df.pivot_table(index='toko', columns='Barang', values='Hasil')
current_df

Barang   Minyak   Telur
toko
Bandung  100000  200000
Garut    120000  300000
Jakarta  400000  150000

In [ ]:
current_df.melt()

   Barang   value
0  Minyak  100000
1  Minyak  120000
2  Minyak  400000
3   Telur  200000
4   Telur  300000
5   Telur  150000

In [ ]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                    'B': {0: 1, 1: 3, 2: 5},
                    'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [ ]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [ ]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [ ]:
# The names of 'variable' and 'value' columns can be customized:
pd.melt(df, id_vars=['A'], value_vars=['B'], var_name='myVarname', value_name='myValname')

   A myVarname  myValname
0  a         B          1
1  b         B          3
2  c         B          5

In [ ]:
# If you have multi-index columns:
df.columns = [list('ABC'), list('DEF')]
df

   A  B  C
   D  E  F
0  a  1  2
1  b  3  4
2  c  5  6

In [ ]:
pd.melt(df, col_level=0, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [ ]:
pd.melt(df, id_vars=[('A', 'D')], value_vars=[('B', 'E')])

  (A, D) variable_0 variable_1  value
0      a          B          E      1
1      b          B          E      3
2      c          B          E      5

In [ ]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data).set_index('Hari')
df

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

In [ ]:
df = pd.melt(df.reset_index(), id_vars ='Hari', value_vars =['Kebun Binatang', 'Dufan', 'Disney', 'Bali'], var_name='Tempat Hiburan', value_name='Pengunjung') 
df

     Hari  Tempat Hiburan  Pengunjung
0   Sabtu  Kebun Binatang         271
1  Minggu  Kebun Binatang         399
2   Sabtu           Dufan         501
3  Minggu           Dufan         700
4   Sabtu          Disney        1000
5  Minggu          Disney        1001
6   Sabtu            Bali         900
7  Minggu            Bali         803

# **Stacking and Unstacking**

The concept of stacking comes in handy when we have data with multi indices. Using the stack() function will reshape the dataframe by converting the data into a stacked form. Since we are having multiple indices, that means converting (also called rotating or pivoting) the innermost column index into the innermost row index. Unstacking, as the name implies, does exactly the inverse operation — it will convert the innermost row index back into the innermost column index.

Let’s take a look at the diagram below:

![reshaping_data_stacking_unstaking.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/reshaping_data_stacking_unstaking.png)

As you can see, stacking means rearranging the data vertically (or stacking it on top of each other, hence the name “stacking”), making the shape of the dataframe as a taller and narrower stack (with fewer columns and more rows). And as you probably could figure out, unstacking will do just the opposite, spreading out the data and reshaping it into a shorter but wider dataframe (with fewer rows but more columns).

Note that if you stack and unstack the same dataframe, you will get back the original dataframe, but you have a choice to stack on different indices and get a different shape of dataframe.

Note that the concepts of multi indexing, hierarchical indexing, pivoting, stacking and unstacking are all related, but let’s start by looking at a sample dataframe, and let’s create a sample dataframe with a typical example we are all familiar with — a grading table.

## **Hierarchical indexing (MultiIndex)**

There are various ways to create multiple indices. One of the simplest ways to create a multi index *Series* or *DataFrame* object is by passing a list of two or more arrays to the constructor:

In [ ]:
import numpy as np
df = pd.DataFrame(np.random.rand(4,2),
                  index = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.339307  0.008958
  2  0.383114  0.078262
b 1  0.452560  0.705364
  2  0.400631  0.627380

Other options include passing a dictionary where the keys are spelled out as tuples:

In [ ]:
data = {
    ('California', 2000):33871648,
    ('California', 2010):37253956,
    ('Texas', 2000):20851820,
    ('Texas', 2010):25142261,
    ('New York', 2000):1697657,
    ('New York', 2010):1232345
}

pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25142261
New York    2000     1697657
            2010     1232345
dtype: int64

Finally, you can explicitly create a multi index by using the class method constructors available in the `pd.MultiIndex`:

The `MultiIndex` object is the hierarchical analogue of the standard `Index` object which typically stores the axis labels in pandas objects. You can think of MultiIndex as an array of tuples where each tuple is unique. A *MultiIndex* can be created from a list of arrays (using `MultiIndex.from_arrays()`), an array of tuples (using `MultiIndex.from_tuples()`), a crossed set of iterables (using `MultiIndex.from_product()`), or a DataFrame (using `MultiIndex.from_frame()`). The *Index* constructor will attempt to return a *MultiIndex* when it is passed a list of tuples. The following examples demonstrate different ways to initialize MultiIndexes.

In [ ]:
index = pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])
index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [ ]:
df = pd.DataFrame(np.random.randn(4, 2), index=index)
df

            0         1
a 1 -0.732354  0.038066
  2  0.873256 -0.933658
b 1 -1.143504 -0.655719
  2  1.447273 -0.588022

In [ ]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]
tuples = list(zip(*arrays))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [ ]:
s = pd.Series(np.random.randn(8), index=index)
s

first  second
bar    one       1.483558
       two       2.674876
baz    one       1.006948
       two       1.035198
foo    one      -0.239079
       two      -0.969865
qux    one       1.755031
       two      -0.534103
dtype: float64

When you want every pairing of the elements in two iterables, it can be easier to use the `MultiIndex.from_product()` method:

In [ ]:
iterables = [['bar', 'baz', 'foo', 'qux'], ['one', 'two']]

index = pd.MultiIndex.from_product(iterables, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [ ]:
df = pd.DataFrame(np.random.randn(8, 2), index=index)
df

                     0         1
first second
bar   one     1.975724  0.722985
      two    -0.734944  0.328444
baz   one    -0.007707 -0.000093
      two     0.541377 -1.668374
foo   one    -0.150474 -0.012496
      two    -0.275929  0.993713
qux   one     0.006580 -1.715025
      two     0.212821 -0.755872

You can also construct a *MultiIndex* from a *DataFrame* directly, using the method `MultiIndex.from_frame()`. This is a complementary method to `MultiIndex.to_frame()`.

In [ ]:
df = pd.DataFrame([['bar', 'one'], ['bar', 'two'],
                    ['foo', 'one'], ['foo', 'two']],
                   columns=['first', 'second'])
index = pd.MultiIndex.from_frame(df)
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('foo', 'one'),
            ('foo', 'two')],
           names=['first', 'second'])

In [ ]:
df = pd.DataFrame(np.random.randn(4, 4), index=index)
df

                     0         1         2         3
first second
bar   one     0.211796  0.573248 -1.063152 -1.473277
      two     1.019813  0.763951  0.828049  0.296384
foo   one     2.375985 -0.288352  0.850953 -0.011315
      two    -0.828464 -1.051536 -1.320166  0.395638

As a convenience, you can pass a list of arrays directly into Series or DataFrame to construct a MultiIndex automatically:

In [ ]:
arrays = [np.array(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux']),
           np.array(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'])]
 

s = pd.Series(np.random.randn(8), index=arrays)
s

bar  one   -1.036542
     two   -0.036752
baz  one   -0.432076
     two    0.525917
foo  one    1.271933
     two   -0.275806
qux  one   -0.644482
     two   -0.065990
dtype: float64

In [ ]:
df = pd.DataFrame(np.random.randn(8, 4), index=arrays)
df

                0         1         2         3
bar one -1.318004 -1.329604 -0.302969  0.948243
    two  0.370336  0.297994 -0.798895 -0.703200
baz one  0.667374 -0.067366  0.017562 -0.114241
    two -0.009198 -0.397671 -1.223113  0.619931
foo one -0.237062 -0.268478  0.153964  1.561515
    two -0.960070  0.687975 -2.013206  0.407164
qux one  1.750827  1.053626 -0.098516 -0.415173
    two  1.198500 -1.944325 -0.049081 -1.381675

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(3, 8), index=['A', 'B', 'C'], columns=index)

df

first        bar                 baz  ...       foo       qux
second       one       two       one  ...       two       one       two
A      -1.767522 -0.318598 -0.600632  ... -0.473681 -0.936163 -3.400967
B       1.128684  0.162611  1.019764  ... -0.442425 -0.073657  2.404676
C      -0.789728 -1.230953  0.029550  ... -0.702087 -0.837711 -1.163283

[3 rows x 8 columns]

In [ ]:
pd.DataFrame(np.random.randn(6, 6), index=index[:6], columns=index[:6])

first              bar                 baz                 foo
second             one       two       one       two       one       two
first second
bar   one     0.356678  2.331570 -0.721250  0.171339  0.186590 -1.641386
      two    -1.407982 -1.550184  1.520637 -0.836313 -2.725046  0.642921
baz   one     0.718485 -0.140558 -0.191028 -1.349233 -0.397229  1.950746
      two     0.530054 -0.449418  0.160108 -1.063879  1.373647 -2.156800
foo   one    -0.539747 -1.582283 -1.006312  0.516264  0.015480  0.835465
      two    -1.307809  0.799687 -0.603515 -1.206627  0.565684 -1.099166

Reconstructing the level labels 

Defined levels

In [ ]:
index.get_level_values(0)

Index(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [ ]:
index.get_level_values(0)

Index(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [ ]:
df.columns.levels  # original MultiIndex

FrozenList([['bar', 'baz', 'foo', 'qux'], ['one', 'two']])

In [ ]:

df[['foo','qux']].columns.levels  # sliced

FrozenList([['bar', 'baz', 'foo', 'qux'], ['one', 'two']])

Basic indexing on axis with MultiIndex

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(3, 8), index=['A', 'B', 'C'], columns=index)

df

first        bar                 baz  ...       foo       qux
second       one       two       one  ...       two       one       two
A       1.671626  1.299115 -1.087275  ... -1.148689 -0.914472 -0.128080
B      -0.172342  0.330665  2.169377  ...  1.172491  0.221022  0.200328
C      -0.866173  1.263172 -0.620292  ... -0.714547  1.839245 -0.639131

[3 rows x 8 columns]

In [ ]:
df['bar']

second       one       two
A       1.671626  1.299115
B      -0.172342  0.330665
C      -0.866173  1.263172

In [ ]:
df['bar', 'one']

A    1.671626
B   -0.172342
C   -0.866173
Name: (bar, one), dtype: float64

In [ ]:
df['bar']['one']

A    1.671626
B   -0.172342
C   -0.866173
Name: one, dtype: float64

In [ ]:
# Transfor DataFrame
df = df.T 
df

                     A         B         C
first second
bar   one     1.671626 -0.172342 -0.866173
      two     1.299115  0.330665  1.263172
baz   one    -1.087275  2.169377 -0.620292
      two     0.607549  0.566355 -0.395760
foo   one    -0.706820  0.222724  0.292145
      two    -1.148689  1.172491 -0.714547
qux   one    -0.914472  0.221022  1.839245
      two    -0.128080  0.200328 -0.639131

In [ ]:
df.loc['bar', 'two']

A    1.299115
B    0.330665
C    1.263172
Name: (bar, two), dtype: float64

In [ ]:
df.loc[('bar', 'two')]

A    1.299115
B    0.330665
C    1.263172
Name: (bar, two), dtype: float64

In [ ]:
df.loc[('bar', 'two'), 'A']

1.299114839071429

In [ ]:
df.loc['baz':'foo']

                     A         B         C
first second
baz   one    -1.087275  2.169377 -0.620292
      two     0.607549  0.566355 -0.395760
foo   one    -0.706820  0.222724  0.292145
      two    -1.148689  1.172491 -0.714547

In [ ]:
df.loc[('baz', 'two'):('qux', 'one')]

                     A         B         C
first second
baz   two     0.607549  0.566355 -0.395760
foo   one    -0.706820  0.222724  0.292145
      two    -1.148689  1.172491 -0.714547
qux   one    -0.914472  0.221022  1.839245

In [ ]:
df.loc[('baz', 'two'):'foo']

                     A         B         C
first second
baz   two     0.607549  0.566355 -0.395760
foo   one    -0.706820  0.222724  0.292145
      two    -1.148689  1.172491 -0.714547

In [ ]:
df.loc[[('bar', 'two'), ('qux', 'one')]]

                     A         B         C
first second
bar   two     1.299115  0.330665  1.263172
qux   one    -0.914472  0.221022  1.839245

In [ ]:
arrays = [np.array(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux']),
           np.array(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'])]
 

s = pd.Series(np.random.randn(8), index=arrays)
s

bar  one   -0.820154
     two   -0.249272
baz  one    0.282707
     two   -1.681408
foo  one   -1.029769
     two    0.298228
qux  one   -0.413381
     two    0.269599
dtype: float64

In [ ]:
s['qux']

one   -0.413381
two    0.269599
dtype: float64

## Stack (col -> row)

![reshaping_data_stack.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/reshaping_data_stack.png)

> df.stack(level=-1, dropna=True)

Return a reshaped DataFrame or Series having a multi-level
index with one or more new inner-most levels compared to the current DataFrame. The new inner-most levels are created by pivoting the columns of the current dataframe:

  - if the columns have a single level, the output is a Series;
  - if the columns have multiple levels, the new index
    level(s) is (are) taken from the prescribed level(s) and
    the output is a DataFrame.

The new index levels are sorted.

................................................................................................................................................................................................................................................

In [ ]:
df.stack?

### **Single level columns**

In [ ]:
df_single_level_cols = pd.DataFrame([[0, 1], [2, 3]],index=['cat', 'dog'], columns=['weight', 'height'])
df_single_level_cols

     weight  height
cat       0       1
dog       2       3

Stacking a dataframe with a single level column axis returns a Series:

In [ ]:
df_single_level_cols.stack()

cat  weight    0
     height    1
dog  weight    2
     height    3
dtype: int64

### **Multi level columns: simple case**

In [ ]:
multicol1 = pd.MultiIndex.from_tuples([('weight', 'kg'), ('weight', 'pounds')])
df_multi_level_cols1 = pd.DataFrame([[1, 2], [2, 4]], index=['cat', 'dog'], columns=multicol1)
df_multi_level_cols1

    weight
        kg pounds
cat      1      2
dog      2      4

Stacking a dataframe with a multi-level column axis:

In [ ]:
df_multi_level_cols1.stack()

            weight
cat kg           1
    pounds       2
dog kg           2
    pounds       4

### **Missing values**

In [ ]:
multicol2 = pd.MultiIndex.from_tuples([('weight', 'kg'), ('height', 'm')])
df_multi_level_cols2 = pd.DataFrame([[1.0, 2.0], [3.0, 4.0]], index=['cat', 'dog'], columns=multicol2)
df_multi_level_cols2

    weight height
        kg      m
cat    1.0    2.0
dog    3.0    4.0

It is common to have missing values when stacking a dataframe
with multi-level columns, as the stacked dataframe typically
has more values than the original dataframe. Missing values
are filled with NaNs:

In [ ]:
df_multi_level_cols2.stack()

        height  weight
cat kg     NaN     1.0
    m      2.0     NaN
dog kg     NaN     3.0
    m      4.0     NaN

### **Prescribing the level(s) to be stacked**

The first parameter controls which level or levels are stacked:

In [ ]:
df_multi_level_cols2.stack(0)

             kg    m
cat height  NaN  2.0
    weight  1.0  NaN
dog height  NaN  4.0
    weight  3.0  NaN

In [ ]:
df_multi_level_cols2.stack([0, 1])

cat  height  m     2.0
     weight  kg    1.0
dog  height  m     4.0
     weight  kg    3.0
dtype: float64

### **Dropping missing values**

In [ ]:
df_multi_level_cols3 = pd.DataFrame([[None, 1.0], [2.0, 3.0]], index=['cat', 'dog'], columns=multicol2)
df_multi_level_cols3

    weight height
        kg      m
cat    NaN    1.0
dog    2.0    3.0

Note that rows where all values are missing are dropped by
default but this behaviour can be controlled via the dropna
keyword parameter:

In [ ]:
df_multi_level_cols3.stack(dropna=False)

        height  weight
cat kg     NaN     NaN
    m      1.0     NaN
dog kg     NaN     2.0
    m      3.0     NaN

In [ ]:
df_multi_level_cols3.stack(dropna=True)

        height  weight
cat m      1.0     NaN
dog kg     NaN     2.0
    m      3.0     NaN

In [ ]:
df_multi_level_cols3.stack(dropna=True)

        height  weight
cat m      1.0     NaN
dog kg     NaN     2.0
    m      3.0     NaN

### **Multiple levels**

In [ ]:
columns = pd.MultiIndex.from_tuples([
    ('A', 'cat', 'long'), ('B', 'cat', 'long'),
    ('A', 'dog', 'short'), ('B', 'dog', 'short')],
    names=['exp', 'animal', 'hair_length']
)

df = pd.DataFrame(np.random.randn(4, 4), columns=columns)

df

exp                 A         B         A         B
animal            cat       cat       dog       dog
hair_length      long      long     short     short
0           -2.762317  0.018296  0.752598  1.447585
1           -1.053382  0.381438  0.629799  0.239616
2           -0.453556  0.906931  0.819277  1.104094
3           -1.370994  0.740321  0.665091  0.139976

In [ ]:
df.stack(level=['animal', 'hair_length'])

exp                          A         B
  animal hair_length
0 cat    long        -2.762317  0.018296
  dog    short        0.752598  1.447585
1 cat    long        -1.053382  0.381438
  dog    short        0.629799  0.239616
2 cat    long        -0.453556  0.906931
  dog    short        0.819277  1.104094
3 cat    long        -1.370994  0.740321
  dog    short        0.665091  0.139976

The list of levels can contain either level names or level numbers (but not a mixture of the two).

In [ ]:
# df.stack(level=['animal', 'hair_length'])
# from above is equivalent to:
df.stack(level=[1, 2])

exp                          A         B
  animal hair_length
0 cat    long        -2.762317  0.018296
  dog    short        0.752598  1.447585
1 cat    long        -1.053382  0.381438
  dog    short        0.629799  0.239616
2 cat    long        -0.453556  0.906931
  dog    short        0.819277  1.104094
3 cat    long        -1.370994  0.740321
  dog    short        0.665091  0.139976

## **Unstack** (Row -> Col)

![reshaping_data_unstack01.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/reshaping_data_unstack01.png)

![reshaping_data_unstack02.png](https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Images/reshaping_data_unstack02.png)

> df.unstack(level=-1, fill_value=None)

Returns a DataFrame having a new level of column labels whose inner-most level
consists of the pivoted index labels.

If the index is not a MultiIndex, the output will be a Series
(the analogue of stack when the columns are not a MultiIndex).

* level : int, str, or list of these, default -1 (last level)
    
Level(s) of index to unstack, can pass level name.

* fill_value : int, str or dict

Replace NaN with this value if the unstack produces missing values.

In [ ]:
df.unstack?

In [ ]:
index = pd.MultiIndex.from_tuples([('one', 'a'), ('one', 'b'), ('two', 'a'), ('two', 'b')])
s = pd.Series(np.arange(1.0, 5.0), index=index)
s

one  a    1.0
     b    2.0
two  a    3.0
     b    4.0
dtype: float64

In [ ]:
s.unstack(level=-1)

       a    b
one  1.0  2.0
two  3.0  4.0

In [ ]:
s.unstack(level=0)

   one  two
a  1.0  3.0
b  2.0  4.0

In [ ]:
df = s.unstack(level=0)
df.unstack()

one  a    1.0
     b    2.0
two  a    3.0
     b    4.0
dtype: float64

## **Addition**

In [ ]:
 arrays = [['Week 1', 'Week 1', 'Week 2', 'Week 2', 'Week 3', 'Week 3', 'Week 4', 'Week 4'],
           ['1. Python', '2. Github', '3. Matplotlib', '4. SQL', '5. Pokemon', '6. OOP', '7. Pandas', '8. Stats']]

In [ ]:
ar2 = [['Student A', 'Student A', 'Student B', 'Student B'], ['Labs', 'Prj', 'Labs', 'Prj']]

In [ ]:
data = [[100, 70, 80, 80, 60, 90, 70, 80], [100,70,70,70,60,80,70,80], [100,90,60,70,80,70,70,80], [80,90,70,80,90,80,100,90]]
data = np.array(data)
df = pd.DataFrame(data, index=ar2, columns=arrays)
df

                  Week 1                  Week 2  ... Week 3    Week 4
               1. Python 2. Github 3. Matplotlib  ... 6. OOP 7. Pandas 8. Stats
Student A Labs       100        70            80  ...     90        70       80
          Prj        100        70            70  ...     80        70       80
Student B Labs       100        90            60  ...     70        70       80
          Prj         80        90            70  ...     80       100       90

[4 rows x 8 columns]

Before we even run some statistics, let’s think about how we would like to see the data. This view can give us some idea about the overall performance of the class, but as an individual student you might want to quickly see all your grades across every subject and activity since the beginning of the course — so let’s unstack the original dataframe to get the following:

In [ ]:
df1 = df.unstack()
df1

             Week 1                     ...    Week 4
          1. Python      2. Github      ... 7. Pandas      8. Stats
               Labs  Prj      Labs Prj  ...      Labs  Prj     Labs Prj
Student A       100  100        70  70  ...        70   70       80  80
Student B       100   80        90  90  ...        70  100       80  90

[2 rows x 16 columns]

Note that we can go back to the original dataframe by running the inverse function, stack():

In [ ]:
df_orig = df1.stack()
df_orig

                  Week 1                  Week 2  ... Week 3    Week 4
               1. Python 2. Github 3. Matplotlib  ... 6. OOP 7. Pandas 8. Stats
Student A Labs       100        70            80  ...     90        70       80
          Prj        100        70            70  ...     80        70       80
Student B Labs       100        90            60  ...     70        70       80
          Prj         80        90            70  ...     80       100       90

[4 rows x 8 columns]

In [ ]:
df2 = df1.unstack()
df2

Week 1  1. Python      Labs  Student A    100
                             Student B    100
                       Prj   Student A    100
                             Student B     80
        2. Github      Labs  Student A     70
                             Student B     90
                       Prj   Student A     70
                             Student B     90
Week 2  3. Matplotlib  Labs  Student A     80
                             Student B     60
                       Prj   Student A     70
                             Student B     70
        4. SQL         Labs  Student A     80
                             Student B     70
                       Prj   Student A     70
                             Student B     80
Week 3  5. Pokemon     Labs  Student A     60
                             Student B     80
                       Prj   Student A     60
                             Student B     90
        6. OOP         Labs  Student A     90
                             Student B     70
                       Prj   Student A     80
                             Student B     80
Week 4  7. Pandas      Labs  Student A     70
                             Student B     70
                       Prj   Student A     70
                             Student B    100
        8. Stats       Labs  Student A     80
                             Student B     80
                       Prj   Student A     80
                             Student B     90
dtype: int64

Here, all the columns indices shifted to the row axis, and we can now see the overall performance of all students across every subject and activity since the beginning of the course.

When I tried to stack the last result back, I got a surprise: Series’ object has no attribute ‘stack.’

In [ ]:
# df2_stack_back = df2.stack() 'Series' object has no attribute 'stack'

The reason is that once we “run out” of row indices, the dataframe becomes a series, and if we try to stack we’ll get an error. But, since it’s a series, we can unstack this series:

In [ ]:
df3 = df2.unstack()
df3

                           Student A  Student B
Week 1 1. Python     Labs        100        100
                     Prj         100         80
       2. Github     Labs         70         90
                     Prj          70         90
Week 2 3. Matplotlib Labs         80         60
                     Prj          70         70
       4. SQL        Labs         80         70
                     Prj          70         80
Week 3 5. Pokemon    Labs         60         80
                     Prj          60         90
       6. OOP        Labs         90         70
                     Prj          80         80
Week 4 7. Pandas     Labs         70         70
                     Prj          70        100
       8. Stats      Labs         80         80
                     Prj          80         90